using ConsoleApp22;
using System.Text;

Console.OutputEncoding = Encoding.UTF8;

MountainNavigation.LetsStartNewJourney();

// -----------------------------------------------------------------------------

// Інстуркції:
// У списках файлів збірки ще один файл MountainNavigation. Це я написав клас, який треба використовувати. Його змінювати не треба.
// Використання мого класу MountainNavigation (це той файл що я написав) дуже схоже на роботу з класом Console

// MountainNavigation.LetsStartNewJourney();  - почне нову гру. Вище ця команда вже використовується.
// Тобі в консоль воно виведе інформацію про гру, як нею грати і карту, яку воно сформувало (кожен раз нову).

// MountainNavigation.MoveTheSpaceShip(х, y); - рухає твій космічний корабель по планеті. Приймає два параметри x - рух по вертикалі та y  по горизонталі.
// При цьому рух можна робити лише на одну клітинку зараз. Після руху воно в консолі намалює поточний стан на карті, а також поверне тобі true або false, де true значить, що кінцевої мети досягнуто.
// При застосуванні команди консоль очиститься, відбудеться обробка маршруту та буде намальована карта з новим розташування корабля.
// Наприклад:
// bool finished = MountainNavigation.MoveTheSpaceShip(-1, -1);

// GetShipPosition() - повертає кортеж з двох значень, координати твого корабля. Кортежі ми не вчили, але суть проста, воно поверне не одну, а два значення в змінні.
// Наприклад:
// (int x, int y) = MountainNavigation.GetShipPosition();

// GetThePlanetMap() повертає масив int[5,4], що є цифровим представленням планети, де 0 - це рівнина, а 1 це гора.
// Ця команда є найважливішою для тебе, адже саме цю інформацію потрібно буде проаналізувати, щоб побудувати маршрут і провести свій корабель через гори.

// ! Важлива умова. В консоль руками нічого вводити не потрібно. Все має порахувати твоя програма, а ти лише в консолі будеш спостерігати за виконанням.
// Все що тобі треба це мій клас і його функції. Ну і твої знання по масивам та циклам.
// Можеш заходити у мій клас і дивитись як це все у мене реалізовано, якщо цікаво. Загалом я це написав доволі швидко, тому там не надто чисто, але ніби працює.
// Доволі скоро ти сам будеш писати класи в окремих файлах, щоб ними користуватися. Але поки все так само пиши в Program.cs

//Зауваж, що важливо довести корабель до перемоги, але якщо програма дійде до кінця не довівши його, то вона просто вимкнеться.

// Всі оці мої інструкції можеш видалити при бажанні. Вони чисто для тебе.
// Наприклад:
//(int x, int y) = MountainNavigation.GetShipPosition();
//Console.WriteLine($"{x} {y}");
//var mapAsArray = MountainNavigation.GetThePlanetMap();
//MountainNavigation.DrawTheMap();
//MountainNavigation.MoveTheSpaceShip(-1, -1);
//MountainNavigation.DrawTheMap();

// -----------------------------------------------------------------------------

// Писати свій код можна нижче цього коментаря. 
